In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [3]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [4]:
data.dropna()

0        1
2    hello
dtype: object

In [5]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [6]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [7]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [8]:
df.dropna(axis=0, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [9]:
# default how='any'
df.dropna(axis=0, how='any')

     0    1  2
1  2.0  3.0  5

In [10]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [11]:
df.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [12]:
# threshold：非缺失值最小数量
df.dropna(axis=0, thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [13]:
# 填充缺失值
data = pd.Series([1, np.nan, 2, None, 'hello'], index=list('abcde'))
data

a        1
b      NaN
c        2
d     None
e    hello
dtype: object

In [14]:
data.fillna(0)

a        1
b        0
c        2
d        0
e    hello
dtype: object

In [15]:
# pad (ffill) or backfill (bfill)
data.fillna(method='ffill')

a        1
b        1
c        2
d        2
e    hello
dtype: object

In [16]:
data.fillna(method='bfill')

a        1
b        2
c        2
d    hello
e    hello
dtype: object

In [17]:
df.fillna(method='ffill', axis='columns')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [18]:
df.fillna(method='ffill', axis=0)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN